Repository: ultibohub/LazarusIDE
Catalog: tools/icons_to_html/languages/icontable.*.po
Languages: ru

source: Error
ru: Ошибка

source: (freely available, no restrictions in usage)
ru: (свободно доступны, использование без ограничений)

source: The images were kindly provided by Roland Hahn (%s).
ru: Изображения любезно предоставлены Roland Hahn (%s).

source: Information
ru: Сведения

source: The images in this folder can be used in Lazarus applications as toolbar or button icons.
ru: Изображения в этом каталоге могут использоваться в приложениях Lazarus в качестве значков инструментальных панелей и кнопок.

source: The different sizes as required by LCL scaling for Hi-DPI screens can be used like this, for example:
ru: Разные размеры, необходимые LCL для масштабирования на экранах Hi-DPI, могут использоваться, например, следующим образом:

source: License: %s
ru: Лицензия: %s

source: Name
ru: Имя

source: No matching PNG image files found in %s
ru: Не найдено соответствующих файлов изображений PNG в %s

source: No PNG image files found in %s
ru: Не найдено файлов изображений PNG в %s

source: Saved as: %s
ru: Сохранено в %s

source: Size
ru: Размер

source: 32x32, 48x48 and 64x64 pixels for "large" images.
ru: 32x32, 48x48 и 64x64 пикселя для "больших" изображений.

source: 24x24, 36x36 and 48x48 pixels for "medium" sized images,
ru: 24x24, 36x36 и 48x48 пикселей для "средних" изображений,

source: 16x16, 24x24 and 32x32 pixels for "small" images,
ru: 16x16, 24x24 и 32x32 пикселя для "малых" изображений,

source: Configuration file could not be saved.
ru: Невозможно сохранить файл настройки.

source: The file could not be saved as: %s
ru: Невозможно сохранить файл %s

source: Folder "%s" does not exist or is currently not available. Should it be removed from the list?
ru: Каталог "%s" не существует либо в настоящий момент недоступен. Удалить его из списка?

source: Temporary file could not be deleted.
ru: Невозможно удалить временный файл.

source: This folder contains %0:d icons in %1:d icon groups with %2:d icon sizes.
ru: Этот каталог содержит значки в количестве %0:d шт. (групп: %1:d; размеров: %2:d).

source: Close
ru: Закрыть

source: Close application
ru: Закрыть приложение

source: Create HTML
ru: Создать HTML

source: Create HTML page for images found in the selected directory
ru: Создать страницу HTML для изображений из выбранного каталога

source: Preview
ru: Предпросмотр

source: Save
ru: Сохранить

source: Save created HTML page as "IconTable.html" file in the specified folder
ru: Сохранить созданную страницу HTML в файле "IconTable.html" указанного каталога

source: IconTable
ru: Таблица значков IconTable

source: Folder with images for which the HTML preview should be created
ru: Каталог с изображениями для создания страницы предпросмотра HTML

# tmainform.menudarkhtmlpage.caption
source: Dark HTML page
ru: Страница HTML с тёмным фоном

# tmainform.menuhtmlpageenglish.caption
source: HTML page in English
ru: Страница HTML на английском языке

# tmainform.tblastdirs.hint
source: Last used
ru: Недавние

# tmainform.tbmenu.hint
source: Options
ru: Параметры
