Repository: ultibohub/LazarusIDE
Catalog: components/lazreport/source/addons/lrspreadsheetexport/languages/le_e_spreadsheet_consts.*.po
Languages: tr

source: All in one page
tr: Hepsi tek sayfada

source: All pages
tr: Tüm sayfalar

source: Auto create file
tr: Dosyayı otomatik oluştur

source: Chunks. Each chunk has (rows):
tr: Parçalar. Her parçanın (satırlar) vardır:

source: Current page
tr: Şimdiki sayfa

source: Data grouping
tr: Veri gruplaması

source: Delete empty rows
tr: Boş satırları sil

source: Enter page numbers and/or page ranges, separated by commas. For example, 1,3,5-12
tr: Sayfa numaralarını ve/veya sayfa aralıklarını girin, virgülle ayrılmış. Örneğin, 1,3,5-12

source: Export page footer
tr: Sayfa sonunu aktar

source: Export page header
tr: Sayfa başlığını aktar

source: Export pictures
tr: Resimleri aktar

source: Export print range
tr: Yazdırma aralığını aktar

source: Export report summary
tr: Rapor özetini aktar

source: Export report title
tr: Rapor başlığını aktar

source: Export settings
tr: Ayarları aktar

source: Export to spreadsheet
tr: E-tabloya aktar

source: Export URL
tr: URL ye aktar

source: General
tr: Genel

source: Like the report
tr: Raporu beğen

source: Merge cells
tr: Hücreleri birleştir

source: Only one TlrSpreadSheetExport component allowed.
tr: Yalnızca bir TlrSpreadSheetExport bileşenine izin verilir.

source: Open after export
tr: Dışa aktarmadan sonra aç

source: Page breaks
tr: Sayfa sonları

source: Page %d
tr: Sayfa %d

source: Page range
tr: Sayfa aralığı

source: Pages:
tr: Sayfalar:

# Rapor
source: Report
tr: Rapor
