Repository: ultibohub/LazarusIDE
Catalog: components/dbexport/languages/sdb_consts.*.po
Languages: tr

source: Available export formats:
tr: Mevcut dışa aktarma formatları:

source: &Cancel
tr: &İptal

source: Configure data export
tr: Veri dışa aktarmayı yapılandır

source: Export progress
tr: Dışa aktarma ilerlemesi

source: Fields
tr: Alanlar

source: Filename:
tr: Dosya adı:

source: Formatting
tr: Biçimlendirme

source: Move selected field down
tr: Seçilen alanı aşağı taşı

source: Move selected field up
tr: Seçilen alanı yukarı taşı

source: Properties for selected field:
tr: Seçilen alanın özellikleri:

source: Select data export Format
tr: Veri dışa aktarma formatını seç

source: Select fi&elds to export
tr: Dışa aktarılacak alanları seç

source: DataExporter has no Dataset assigned.
tr: DataExporter'a veri kümesi atanmadı.

source: Execute ...
tr: Çalıştır ...
