Repository: ultibohub/LazarusIDE
Catalog: components/lazreport/source/addons/addfunction/languages/lr_add_function_const.*.po
Languages: tr

source: Date
tr: Tarih

source: ABS(<Number>)/Returns absolute value <Number>
tr: "ABS(<Numara>)/Mutlak değer döndürür <Numara>"

source: CHR(<Code>)/Returns symbol of ASCII code <Code>.
tr: CHR(<Kod>)/ASCII kodunun sembolünü döndürür <Kod>.

source: COMPARESTR(<String1>,<String2>)/Compares two strings. Returns the position where begins the difference between the strings or 0 if strings are equivalent.
tr: COMPARESTR(<String1>,<String2>)/İki stringi karşılaştırır. Stringler arasındaki farkın başladığı konumu veya stringler eşdeğerse 0'ı döndürür.

source: CREATEDATE(<String>)/Converts <String> string to string that contains date to use it in SQL clause. To use this function put the string with desired date format to TfrAddFunctionLibrary.FormatDate property.
tr: CREATEDATE(<String>)/<String> dizesini, SQL yan tümcesinde kullanılacak tarihi içeren dizeye dönüştürür. Bu işlevi kullanmak için, istenen tarih formatına sahip dizeyi TfrAddFunctionLibrary.FormatDate özelliğine yerleştirin.

source: CREATENUM(<String>)/Converts <String> string to string that contains numeric value to use it in SQL clause.
tr: CREATENUM(<String>)/<String> dizesini SQL yan tümcesinde kullanmak üzere sayısal değer içeren dizeye dönüştürür.

source: CREATESTR(<String>)/Adds quotes to the <String> string to use it in SQL clause.
tr: CREATESTR(<String>)/SQL yan tümcesinde kullanmak için <String> dizesine tırnak işaretleri ekler.

source: DATEDIFF(<Date1>,<Date2>,<var String>)/Returns the difference between two dates <Date1> and <Date2>. Result is in the string <String> in format "days;months;years".
tr: DATEDIFF(<Date1>,<Date2>,<var String>)/<Tarih1> ve <Tarih2> adlı iki tarih arasındaki farkı döndürür. Sonuç, "gün;ay;yıl" biçimindeki <String> dizesindedir.

source: DATETOSTR(<Date>)/Converts date <Date> to string and returns the result.
tr: DATETOSTR(<Date>)/<Tarih> tarihini stringe dönüştürür ve sonucu döndürür.

source: DAYSPERMONTH(<Year>,<Month>)/Returns days in the given month <Month> of the year <Year>.
tr: DAYSPERMONTH(<Year>,<Month>)/<Yıl> yılının belirtilen <Ay> ayındaki günleri döndürür.

source: DELETE(<String>,<DelFrom>,<DelCount>)/Deletes <DelCount> symbols starting at position <DelFrom> in the given string <String> and returns the result.
tr: DELETE(<String>,<DelFrom>,<DelCount>)/Verilen <String> dizesindeki <DelFrom> konumunda başlayan <DelCount> sembollerini siler ve sonucu döndürür.

source: ENDPOS(<String>,<SubStr>)/Returns position of substring <SubStr> in the string <String> starting at the end of the string.
tr: ENDPOS(<String>,<SubStr>)/<String> dizesindeki <SubStr> alt dizesinin dizenin sonundan başlayarak konumunu döndürür.

source: EXTRACTWORD(<WordNo>,<String>,<Delimiters>)/Returns word number <WordNo> from the string <String>.<Delimiters> is the list of word delimiters.
tr: EXTRACTWORD(<WordNo>,<String>,<Delimiters>)/<String> dizesinden <WordNo> sözcük numarasını döndürür.<Sınırlayıcılar> sözcük sınırlayıcılarının listesidir.

source: FIRSTDAYOFNEXTMONTH(<Date>)/Returns the date of first day of the next month of date <Date>.
tr: FIRSTDAYOFNEXTMONTH(<Date>)/<Tarih> tarihinin bir sonraki ayının ilk gününün tarihini döndürür.

source: FIRSTDAYOFPREVMONTH(<Date>)/Returns the date of first day of the previous month of date <Date>.
tr: FIRSTDAYOFPREVMONTH(<Date>)/<Tarih> tarihinden önceki ayın ilk gününün tarihini döndürür.

source: INCDATE(<Date>,<String>)/Increments the date <Date> by given number of days, months and years passed in the <String> parameter in format "days;months;years". Returns the result date.
tr: INCDATE(<Date>,<String>)/<Date> tarihini, <String> parametresinde geçen gün, ay ve yıl sayısına göre "gün;ay;yıl" biçiminde artırır. Sonuç tarihini döndürür.

source: INCDAY(<Date>,<Number>)/Increments the date <Date> by given number of days <Number> and returns the result date.
tr: INCDAY(<Date>,<Number>)/<Tarih> tarihini verilen gün sayısı kadar <Sayı> artırır ve sonuç tarihini döndürür.

source: INCMONTH(<Date>,<Number>)/Increments the date <Date> by given number of months <Number> and returns the result date.
tr: INCMONTH(<Date>,<Number>)/<Tarih> tarihini verilen ay sayısı kadar <Sayı> artırır ve sonuç tarihini döndürür.

source: INCTIME(<Time>,<String>)/Increments the time <Time> by given number of hours, minutes, seconds and milliseconds passed in the <String> parameter in format "h;min;sec;msec". Returns the result time.
tr: INCTIME(<Time>,<String>)/<Time> süresini, <String> parametresinde geçen saat, dakika, saniye ve milisaniye sayısına göre "h;min;sec;msec" biçiminde artırır. Sonuç süresini döndürür.

source: INCYEAR(<Date>,<Number>)/Increments the date <Date> by given number of years <Number> and returns the result date.
tr: INCYEAR(<Date>,<Number>)/<Tarih> tarihini verilen yıl sayısı kadar <Sayı> artırır ve sonuç tarihini döndürür.

source: INSERT(<SubStr>,<String>,<InsertFrom>)/Inserts <SubStr> substring into <String> string starting at position <InsertFrom> and returns the result.
tr: INSERT(<SubStr>,<String>,<InsertFrom>)/<SubStr> alt dizesini <InsertFrom> konumundan başlayarak <String> dizesine ekler ve sonucu döndürür.

source: ISLEAPYEAR(<Year>)/Returns True if <Year> year is leap year.
tr: ISLEAPYEAR(<Year>)/<Yıl> yılı artık yıl ise Doğru değerini döndürür.

source: ISRANGEDATE(<Date1>,<Date2>,<Date3>)/Returns True if date <Date3> is between <Date1> and <Date2>.
tr: ISRANGEDATE(<Date1>,<Date2>,<Date3>)/<Tarih3> tarihi <Tarih1> ile <Tarih2> arasındaysa Doğru değerini döndürür.

source: ISRANGENUM(<Number1>,<Number2>,<Number3>)/Returns True if <Number3> is between <Number1> and <Number2>.
tr: ISRANGENUM(<Number1>,<Number2>,<Number3>)/<Sayı3>, <Sayı1> ile <Sayı2> arasındaysa Doğru değerini döndürür.

source: ISWORDPRESENT(<Word>,<String>,<Delimiters>)/Determines if word <Word> is present in the string <String>.<Delimiters> is the list of word delimiters.
tr: ISWORDPRESENT(<Word>,<String>,<Delimiters>)/<String> dizesinde <Word> sözcüğünün bulunup bulunmadığını belirler.<Sınırlayıcılar> sözcük sınırlayıcılarının listesidir.

source: LASTDAYOFPREVMONTH(<Date>)/Returns the date of last day of the previous month of date <Date>.
tr: LASTDAYOFPREVMONTH(<Date>)/<Tarih> tarihinden önceki ayın son gününün tarihini döndürür.

source: LEFTCOPY(<String>,<Count>)/Copies number of symbols <Count> from the string <String> starting at the begin of the string.
tr: LEFTCOPY(<String>,<Count>)/<String> dizesinden, dizenin başlangıcından başlayarak <Count> sembollerinin sayısını kopyalar.

source: NPOS(<SubStr>,<String>,<SubStrNo>)/Returns position of <SubStrNo>-th substring <SubStr> inclusion in the string <String>.
tr: NPOS(<SubStr>,<String>,<SubStrNo>)/<SubStrNo>-th alt dizesi <SubStr>'in <String> dizesine dahil edilmesinin konumunu döndürür.

source: PADCENTER(<String>,<Length>,<Symbol>)/Adds symbols <Symbol> to begin and end of the string <String> to make it as long as stated in the <Length> parameter and returns result string.
tr: PADCENTER(<String>,<Length>,<Symbol>)/<Length> parametresinde belirtildiği kadar uzun olması için <String> dizesinin başına ve sonuna <Symbol> sembolleri ekler ve sonuç dizesini döndürür.

source: PADLEFT(<String>,<Length>,<Symbol>)/Adds symbols <Symbol> to begin of the string <String> to make it as long as stated in the <Length> parameter and returns result string.
tr: PADLEFT(<String>,<Length>,<Symbol>)/<Length> parametresinde belirtildiği kadar uzun olması için <String> dizesinin başlangıcına <Symbol> sembollerini ekler ve sonuç dizesini döndürür.

source: PADRIGHT(<String>,<Length>,<Symbol>)/Adds symbols <Symbol> to end of the string <String> to make it as long as stated in the <Length> parameter and returns result string.
tr: PADRIGHT(<String>,<Length>,<Symbol>)/<Length> parametresinde belirtildiği kadar uzun olması için <String> dizesinin sonuna <Symbol> sembollerini ekler ve sonuç dizesini döndürür.

source: REPLACESTR(<String>,<SubStr1>,<SubStr2>)/Replaces all inclusions of <SubStr1> string to the <SubStr2> string in the string <String> and returns the result.
tr: REPLACESTR(<String>,<SubStr1>,<SubStr2>)/<SubStr1> dizesinin tüm eklemelerini <String> dizesindeki <SubStr2> dizesiyle değiştirir ve sonucu döndürür.

source: REPLICATE(<Symbol>,<Length>)/Returns the string with length <Length> that consists of symbols <Symbol>.
tr: REPLICATE(<Symbol>,<Length>)/<Symbol> sembollerinden oluşan <Length> uzunluğuna sahip dizeyi döndürür.

source: RIGHTCOPY(<String>,<Count>)/Copies number of symbols <Count> from the string <String> starting at the end of the string.
tr: RIGHTCOPY(<String>,<Count>)/<String> dizesinden, dizenin sonundan başlayarak <Count> sembollerinin sayısını kopyalar.

source: STRTODATEDEF(<String>,<DefDate>)/Converts <String> string to date. If conversion fails, returns default value <DefDate>.
tr: STRTODATEDEF(<String>,<DefDate>)/<String> dizesini tarihe dönüştürür. Dönüştürme başarısız olursa, <DefDate> varsayılan değerini döndürür.

source: STRTOFLOAT(<String>)/Converts <String> string to the float value.
tr: STRTOFLOAT(<String>)/<String> dizesini float değerine dönüştürür.

source: STRTOFLOATDEF(<String>,<DefValue>)/Converts <String> string to float value. If conversion fails, returns default value <DefValue>.
tr: STRTOFLOATDEF(<String>,<DefValue>)/<String> dizesini float değere dönüştürür. Dönüştürme başarısız olursa, <DefValue> varsayılan değerini döndürür.

source: STRTOINT(<String>)/Converts <String> string to the integer value.
tr: STRTOINT(<String>)/<String> stringini tamsayıya dönüştürür.

source: STRTOINTDEF(<String>,<DefValue>)/Converts <String> string to integer value. If conversion fails, returns default value <DefValue>.
tr: STRTOINTDEF(<String>,<DefValue>)/<String> dizesini tam sayı değerine dönüştürür. Dönüştürme başarısız olursa, <DefValue> varsayılan değerini döndürür.

source: SWAP(<var var1>,<var var2>)/Swaps the variables var1 and var2.
tr: SWAP(<var var1>,<var var2>)/var1 ve var2 değişkenlerini değiştirir.

source: TIMETOSTR(<Time>)/Converts time <Time> to string and returns the result.
tr: TIMETOSTR(<Time>)/<Time> zamanını stringe dönüştürür ve sonucu döndürür.

source: TRIMLEFT(<String>)/Trims all left spaces from the string <String> and returns the result.
tr: TRIMLEFT(<String>)/<String> dizesindeki tüm sol boşlukları kırpar ve sonucu döndürür.

source: TRIMRIGHT(<String>)/Trims all right spaces from the string <String> and returns the result.
tr: TRIMRIGHT(<String>)/<String> dizesindeki tüm sağ boşlukları kırpar ve sonucu döndürür.

source: VALIDDATE(<String>)/Returns True if <String> string is valid date.
tr: VALIDDATE(<String>)/<String> geçerli bir tarih değeri ise True değerini döndürür.

source: VALIDFLOAT(<String>)/Returns True if <String> is valid float value.
tr: VALIDFLOAT(<String>)/<String> geçerli bir virgüllü sayı değeri ise True değerini döndürür.

source: VALIDINT(<String>)/Returns True if <String> is valid integer value.
tr: VALIDINT(<String>)/<String> geçerli bir tamsayı değeri ise True değerini döndürür.

source: WORDCOUNT(<String>,<Delimiters>)/Returns number of words in the string <String>.<Delimiters> is the list of word delimiters.
tr: WORDCOUNT(<String>,<Delimiters>)/<String> dizesindeki sözcük sayısını döndürür.<Sınırlayıcılar>, sözcük sınırlayıcıların listesidir.

source: WORDPOSITION(<WordNo>,<String>,<Delimiters>)/Returns position of word number <WordNo> in the string <String>.<Delimiters> is the list of word delimiters.
tr: WORDPOSITION(<WordNo>,<String>,<Delimiters>)/<String> dizesindeki <WordNo> sözcük numarasının konumunu döndürür.<Sınırlayıcılar> sözcük sınırlayıcılarının listesidir.

source: Math
tr: Matematik

source: Other
tr: Diğer
