Repository: ultibohub/LazarusIDE
Catalog: components/dockedformeditor/languages/dockedstrconsts.*.po
Languages: tr

source: Allow size changing
tr: Boyut değiştirmeye izin ver

source: Grips can change size in Anchor Editor
tr: Çapalar Anchor Editor'da boyut değiştirebilir

source: Bottom Anchor
tr: Alt Çapa

source: Border Around Control
tr: Kontrol Etrafında Kenarlık

source: Control Background
tr: Kontrol Arka Planı

source: Left Anchor
tr: Sol Çapa

source: Right Anchor
tr: Sağ Çapa

source: Anchors
tr: Çapalar

source: Show Anchors Tab
tr: Çapalar Sekmesini Göster

source: Show Anchor Editor
tr: Anchor Editor'u Göster

source: Anchor Target
tr: Çapa Hedefi

source: Top Anchor
tr: Üst Çapa

source: Attach Control
tr: Kontrolü Bağla

source: Attach Control Sides
tr: Kontrol Kenarlarını Bağla

source: Attach Control Side
tr: Kontrol Kenarını Bağla

source: Docked Form Editor
tr: Yerleştirilmiş Form Editörü

source: Capture Distance
tr: Yakalama Mesafesi

source: Minimal distance to capture a control with mouse
tr: Bir kontrolü fare ile yakalamak için asgari mesafe

source: This will create a circular dependency.
tr: Bu, dairesel bir bağımlılık oluşturacak.

source: Colors
tr: Renkler

source: Detach Control
tr: Kontrolü Ayır

source: Detach Control Sides
tr: Kontrol Kenarlarını Ayır

source: Detach Control Side
tr: Kontrol Kenarını Ayır

source: Show the form-editor as (docked) tab in the editor window (Requires IDE restart)
tr: Form düzenleyicisini editör penceresinde (yerleştirilmiş) sekme olarak göster (IDE yeniden başlatılması gerekir)

source: Classic Form Editor (floating):
tr: Klasik Form Editörü (yüzer):

source: The form editor is part of the IDE's source editor (tabbed interface).
tr: Form editörü, IDE'nin kaynak düzenleyicisinin (sekme arayüzünün) bir parçasıdır.

source: The form editor shows the edited form as a normal window.
tr: Form editörü, düzenlenmiş formu normal bir pencere olarak gösterir.

source: The "classic" designer can be positioned on your screen independent of other parts of the IDE. The "modern" docked designer will be embedded into the source-edit window, and you will have a tab to toggle between source and form. You can open a 2nd source-edit window to see both at the same time.
tr: "Klasik" tasarımcıyı, IDE'nin diğer parçalarından bağımsız olarak ekranınıza yerleştirebilirsiniz. "Modern" yerleştirilmiş tasarımcı, kaynak düzenleme penceresine gömülecek ve kaynak ile form arasında geçiş yapmak için bir sekmeniz olacak. Her ikisini de aynı anda görmek için ikinci bir kaynak düzenleme penceresi açabilirsiniz.

source: Modern Form Editor (docked/tabbed):
tr: Modern Form Editörü (yerleştirilmiş/sekme):

source: You can change this in the IDE options under: "Docked Form Editor"
tr: Bunu, IDE seçeneklerinde "Docked Form Editor" altında değiştirebilirsiniz.

source: Force Refreshing At Sizing
tr: Boyutlandırmada Zorunlu Yenileme

source: Force refreshing form when user is sizing it
tr: Kullanıcı boyutlandırırken formu zorunlu olarak yenile

source: Form editor / Designer
tr: Form editörü / Tasarımcı

source: IDE Layout
tr: IDE Düzeni

source: Mouse cursor factor for BorderSpacing property
tr: BorderSpacing özelliği için fare imleci faktörü

source: Mouse cursor factor is used to set small values of BorderSpacing property more precisely
tr: Fare imleci faktörü, BorderSpacing özelliğinin küçük değerlerini daha kesin olarak ayarlamak için kullanılır

source: Resizer Color
tr: Yeniden Boyutlandırıcı Renk

source: Color of resizer bars
tr: Yeniden boyutlandırıcı çubukların rengi

source: Bottom
tr: Alt

source: Tab Position
tr: Sekme Pozisyonu

source: Position of Code, Form, Anchors tabs
tr: Kod, Form, Çapalar sekmelerinin pozisyonu

source: Left
tr: Sol

source: Right
tr: Sağ

source: Top
tr: Üst

source: Automatically treat Align properties
tr: Hizalama özelliklerini otomatik olarak işleyin

source: Automatically replace Align properties with appropriate Anchors
tr: Hizalama özelliklerini uygun çapalarla otomatik olarak değiştirin

source: Automatically treat BorderSpacing properties
tr: BorderSpacing özelliklerini otomatik olarak işleyin

source: Automatically replace BorderSpacing.Around properties of controls and adapt BorderSpacing.Left/Right/Top/Bottom if needed
tr: Kontrollerin BorderSpacing.Around özelliklerini otomatik olarak değiştirin ve gerekirse BorderSpacing.Left/Right/Top/Bottom ayarlayın

source: Warning
tr: Uyarı
